use Suraho_UNIVER
CREATE TABLE NEW_STUDENT(
	Номер_зачетки int PRIMARY KEY NOT NULL,
	ФИО nvarchar(50) NOT NULL,
	Дата_рождения date NOT NULL,
	Пол nvarchar(1) NOT NULL,
	Дата_поступления date NOT NULL
);

INSERT INTO NEW_STUDENT(Номер_зачетки, ФИО, Дата_рождения, Пол, Дата_поступления)
	VALUES (1, 'Иванов Иван Иванович', '20.09.2000', 'М', '21.11.2018'),
		(2, 'Петров Петр Петрович', '12.06.2002', 'М', '11.03.2019'),
		(3, 'Кукушкина Ирина Павловна', '29.03.2000', 'Ж', '3.05.2019'),
		(4, 'Сидорова Анастасия Сергеевна', '6.11.2001', 'Ж', '15.12.2018'),
		(5, 'Петрова Надежда Ивановна', '1.06.2000', 'Ж', '9.01.2019');

SELECT * FROM NEW_STUDENT WHERE Пол = 'Ж' AND ((DATEDIFF(day,Дата_рождения, Дата_поступления)/365) >= 18);